<?php
// +----------------------------------------------------------------------
// | 日志设置
// +----------------------------------------------------------------------
return [
    // 默认日志记录通道
    'default'      => 'file',
    // 日志记录级别
    'level'        => [],
    // 日志类型记录的通道
    'type_channel' => [],
    // 关闭全局日志写入
    'close'        => false,
    // 日志格式
    'format'       => '[%s][%s] %s',
    // 是否实时写入
    'realtime_write' => false,
    // 日志通道列表
    'channels'     => [
        'file' => [
            // 日志记录方式
            'type'        => 'File',
            // 日志保存目录
            'path'        => '',
            // 单个日志文件的大小
            'single'      => false,
            // 日志的时间格式
            'time_format' => 'Y-m-d H:i:s',
            // 是否使用JSON写入
            'json'        => false,
            // 最大日志文件数量
            'max_files'   => 0,
        ],
    ],
];
